       01  REC-OUTFILE.                                                 00039300
           03  OUTFILE-TEXT              PIC -9(18).                    00039400
           03  OUTFILE-UNPACKED          PIC  9(18).                    00039400
           03  OUTFILE-UNPACKED-SIGNED   PIC S9(18).                    00039400
           03  OUTFILE-COMP              PIC  9(18) COMP.               00039500
           03  OUTFILE-COMP-SIGNED       PIC S9(18) COMP.               00039500
           03  OUTFILE-COMP3             PIC  9(18) COMP-3.             00039500
           03  OUTFILE-COMP3-SIGNED      PIC S9(18) COMP-3.             00039500